# Use `brew bundle --file=$HOME/.brewfile` to install the packages listed below

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'heroku/brew'
tap 'thoughtbot/formulae'
tap 'universal-ctags/universal-ctags'

# Packages
brew 'dasht'
brew 'direnv'
brew 'fish'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'heroku'
brew 'hub'
brew 'irssi'
brew 'jq'
brew 'mas'
brew 'mobile-shell'
brew 'node'
brew 'parity'
brew 'pgformatter'
brew 'postgres'
brew 'redis'
brew 'rename'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'universal-ctags', args: ['HEAD']
brew 'vim'
brew 'yarn'

# Casks
cask_args appdir: '/Applications'
cask '1password'
cask 'alacritty'
cask 'discord'
cask 'firefox-developer-edition'
cask 'mark-text'
cask 'ngrok'
cask 'sizeup'
cask 'slack'

# Fonts
cask 'font-hasklig'

# App Store
# mas 'Trello', id: 1278508951
